Repository: JHdehao/Conch
Catalog: Conch/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: 连不上 %@。请确认地址正确、对方开着 Conch，走 Tailscale 时两边都要连上 Tailscale。
en: Couldn't reach %@. Check the address and that Conch is open there; over Tailscale, both devices must be connected to Tailscale.
zh_hant: 連不上 %@。請確認位址正確、對方開著 Conch，走 Tailscale 時兩邊都要連上 Tailscale。

source: 连不上对方。请确认两台设备都开着 Conch，并在同一个 Wi‑Fi 下。
en: Couldn't reach the other device. Make sure both have Conch open and are on the same Wi‑Fi.
zh_hant: 連不上對方。請確認兩台裝置都開著 Conch，並在同一個 Wi‑Fi 下。

source: 连接
en: Connect
zh_hant: 連線

source: 连接 %@
en: Connect to %@
zh_hant: 連線 %@

source: 连接 AI 服务
en: Connect an AI Service
zh_hant: 連線 AI 服務

source: 连接中
en: Connecting
zh_hant: 連線中

source: 连接中断，%lld 秒后第 %lld 次重连…（按回车立即重试）
en: Connection lost. Reconnecting in %lld s (attempt %lld)… (press Return to retry now)
zh_hant: 連線中斷，%lld 秒後第 %lld 次重連…（按回車立即重試）

source: 连接保活
en: Keep Alive
zh_hant: 連線保活

source: 连接后自动进入 tmux
en: Enter tmux After Connecting
zh_hant: 連線後自動進入 tmux

source: 连接地点
en: Connection Locations
zh_hant: 連線地點

source: 连接地点记录
en: Connection Records
zh_hant: 連線地點記錄

source: 连接失败
en: Connection Failed
zh_hant: 連線失敗

source: 连接失败：%@
en: Connection failed: %@
zh_hant: 連線失敗：%@

source: 连接已中断（网络断开或服务器无响应）。
en: The connection was lost (network down or server not responding).
zh_hant: 連線已中斷（網路中斷或伺服器無響應）。

source: 连接已关闭
en: Connection closed
zh_hant: 連線已關閉

source: 连接已断开。
en: The connection was lost.
zh_hant: 連線已中斷。

source: 连接断开超过 15 分钟，不再重连。这一轮可能还在电脑上运行，稍后重新打开这个对话可以看到结果。
en: Disconnected for over 15 minutes; no longer reconnecting. The turn may still be running on the computer — reopen this conversation later to see the result.
zh_hant: 連線中斷超過 15 分鐘，不再重連。這一輪可能還在電腦上執行，稍後重新打開這個對話可以看到結果。

source: 连接断开，正在重连…（这一轮在电脑上继续运行）
en: Disconnected, reconnecting… (the turn keeps running on the computer)
zh_hant: 連線中斷，正在重連…（這一輪在電腦上繼續執行）

source: 连接校验失败，可能有人在冒充对方设备。已中止，没有发送任何内容。
en: Connection check failed; someone may be impersonating the other device. Stopped without sending anything.
zh_hant: 連線校驗失敗，可能有人在冒充對方裝置。已中止，沒有傳送任何內容。

source: 连接被拒绝，请检查端口，以及服务器上的 SSH 服务是否在运行。
en: Connection refused. Check the port and whether the SSH service is running on the server.
zh_hant: 連線被拒絕，請檢查連接埠，以及伺服器上的 SSH 服務是否在執行。

source: 连接超时，请检查主机地址和网络。
en: The connection timed out. Check the host address and network.
zh_hant: 連線超時，請檢查主機位址和網路。

source: 连续 %lld 次无响应
en: %lld missed in a row
zh_hant: 連續 %lld 次無響應

source: 退出 Tailscale 登录？
en: Sign Out of Tailscale?
zh_hant: 登出 Tailscale？

source: 退出登录
en: Sign Out
zh_hant: 登出

# 退出码 %@ %@
source: 退出码 %1$@ %2$@
en: Exit code %@ %@
zh_hant: 結束碼 %@ %@

source: 退出码 %lld
en: Exit code %lld
zh_hant: 退出碼 %lld

source: 退出码 %lld %@
en: Exit code %lld %@
zh_hant: 退出碼 %lld %@

source: 选择一台服务器开始会话。
en: Choose a server to start a session.
zh_hant: 選擇一台伺服器開始會話。

source: 选择助手
en: Choose an Agent
zh_hant: 選擇助手

source: 选择思考强度
en: Choose effort
zh_hant: 選擇思考強度

source: 选择服务器
en: Choose Servers
zh_hant: 選擇伺服器

source: 选择模型
en: Choose a model
zh_hant: 選擇模型

source: 选择此目录
en: Choose This Folder
zh_hant: 選擇此目錄

source: 选择电脑
en: Choose a Computer
zh_hant: 選擇電腦

source: 选择目录
en: Choose Folder
zh_hant: 選擇目錄

source: 选项
en: Choice
zh_hant: 選項

source: 通过 SSH 启动 mosh-server…
en: Starting mosh-server over SSH…
zh_hant: 通過 SSH 啓動 mosh-server…

source: 通过 SSH 在你的电脑上运行 Claude Code 或 Codex，像聊天一样指挥它写代码。电脑和手机不在同一个网络时，可以用 Tailscale 组网后连接。
en: Run Claude Code or Codex on your computer over SSH and direct it like a chat. If your computer and phone are on different networks, connect them with Tailscale.
zh_hant: 通過 SSH 在你的電腦上執行 Claude Code 或 Codex，像聊天一樣指揮它寫程式碼。電腦和手機不在同一個網路時，可以用 Tailscale 組網後連線。

source: 通过 Tailscale 的连接会断开。
en: Connections through Tailscale will be closed.
zh_hant: 透過 Tailscale 的連線會中斷。

# 通过 Tailscale 连接 %@ 失败：%@
source: 通过 Tailscale 连接 %1$@ 失败：%2$@
en: Couldn't connect to %@ over Tailscale: %@
zh_hant: 透過 Tailscale 連線 %@ 失敗：%@

# 通过 Tailscale 连接 %@ 超时。对方设备可能离线，或者没有在端口 %lld 上提供服务。
source: 通过 Tailscale 连接 %1$@ 超时。对方设备可能离线，或者没有在端口 %2$lld 上提供服务。
en: Connecting to %@ over Tailscale timed out. The device may be offline, or nothing is listening on port %lld.
zh_hant: 透過 Tailscale 連線 %@ 逾時。對方裝置可能離線，或者沒有在連接埠 %lld 上提供服務。

source: 速度和能力均衡，适合日常编程
en: Balanced speed and capability for everyday coding
zh_hant: 速度和能力均衡，適合日常程式設計

source: 速率
en: Rate

source: 配对于 %@
en: Paired %@
zh_hant: 配對於 %@

source: 配置 %@ 免密登录
en: Set up key login for %@
zh_hant: 配置 %@ 免密登入

source: 采用建议
en: Use Suggestion
zh_hant: 採用建議

source: 采用灰色的建议（Tab）
en: Use the grey suggestion (Tab)
zh_hant: 採用灰色的建議（Tab）

source: 重命名这个会话
en: Rename this session
zh_hant: 重命名這個會話

source: 重新启动
en: Relaunch
zh_hant: 重新啟動

source: 重新启动 Conch 后，界面会切换为%@。
en: Conch will switch to %@ after it relaunches.
zh_hant: 重新啟動 Conch 後，介面會切換為%@。

source: 重新启动 Conch？
en: Relaunch Conch?
zh_hant: 重新啟動 Conch？

source: 重新检查
en: Check Again
zh_hant: 重新檢查

source: 重新载入
en: Reload
zh_hant: 重新載入

source: 重新载入网页
en: Reload Page
zh_hant: 重新載入網頁

source: 重新连接
en: Reconnect
zh_hant: 重新連線

source: 重新连接中…
en: Reconnecting…
zh_hant: 重新連線中…

source: 重试
en: Retry
zh_hant: 重試

source: 钥匙串里找不到这把密钥的私钥，请重新导入。
en: This key's private key isn't in the keychain. Import it again.
zh_hant: 鑰匙圈里找不到這把金鑰的私鑰，請重新導入。

source: 钥匙串错误（%d）：%@
en: Keychain error (%d): %@
zh_hant: 鑰匙圈錯誤（%d）：%@

source: 错误：%@
en: Error: %@
zh_hant: 錯誤：%@

source: 长按一行可以结束进程
en: Touch and hold a row to end the process
zh_hant: 長按一列可以結束程序

source: 闪烁
en: Blink
zh_hant: 閃爍

source: 问问 Conch 助手
en: Ask Conch Assistant
zh_hant: 問問 Conch 助理

source: 问问 Conch 助手…
en: Ask the Conch Assistant…
zh_hant: 問問 Conch 助手…

source: 附件上传失败：%@
en: Couldn’t upload attachments: %@
zh_hant: 附件上傳失敗：%@

source: 附近的设备
en: Nearby Devices
zh_hant: 附近的裝置

source: 隐藏文件
en: Hidden Files
zh_hant: 隱藏檔案

source: 需要密码。
en: A password is required.
zh_hant: 需要密碼。

source: 需要登录
en: Sign-in needed
zh_hant: 需要登入

source: 需要登录（用 login 让用户登录）
en: sign-in needed (use login to have the user sign in)
zh_hant: 需要登入（用 login 讓使用者登入）

source: 需要麦克风和语音识别权限。请在系统设置里允许 Conch。
en: Microphone and speech recognition access are needed. Allow Conch in Settings.
zh_hant: 需要麥克風和語音辨識權限。請在系統設定里允許 Conch。

source: 页面上没有找到“%@”。
en: “%@” wasn't found on the page.
zh_hant: 頁面上沒有找到「%@」。

source: 页面不存在（404）
en: Page not found (404)
zh_hant: 頁面不存在（404）

source: 页面没有响应
en: The page isn't responding
zh_hant: 頁面沒有回應

# 页面约 %lld 屏，当前在第 %lld 屏
source: 页面约 %1$lld 屏，当前在第 %2$lld 屏
en: The page is about %lld screens long; now on screen %lld
zh_hant: 頁面約 %lld 屏，目前在第 %lld 屏

source: 项目目录
en: Project Folder
zh_hant: 專案目錄

source: 颜色
en: Color
zh_hant: 顏色

source: 首次连接到 %@
en: First Connection to %@
zh_hant: 首次連線到 %@

source: 首次连接并信任服务器后，会记录在这里。
en: Servers you connect to and trust are recorded here.
zh_hant: 首次連線並信任伺服器後，會記錄在這裡。

source: 验证改动是否真的生效
en: Check that the change actually works
zh_hant: 驗證改動是否真的生效

source: 高
en: High

# 高亮了 %lld 处“%@”
source: 高亮了 %1$lld 处“%2$@”
en: Highlighted “%2$@” in %1$lld places
zh_hant: 高亮了 %lld 處“%@”

source: 高级
en: Advanced
zh_hant: 進階

source: 麦克风按钮按这个语言识别。说话时想临时换一种语言，右键点按麦克风就能切换。
en: The microphone button listens for this language. To switch quickly while dictating, Control-click the microphone.
zh_hant: 麥克風按鈕按這個語言辨識。說話時想臨時換一種語言，按右鍵點按麥克風就能切換。

source: 麦克风按钮按这个语言识别。说话时想临时换一种语言，长按麦克风就能切换。
en: The microphone button listens for this language. To switch quickly while dictating, touch and hold the microphone.
zh_hant: 麥克風按鈕按這個語言辨識。說話時想臨時換一種語言，長按麥克風就能切換。

source: 默认
en: Default
zh_hant: 預設

source: 默认 Tailscale 官方；自建 Headscale 填它的地址
en: Tailscale's by default; enter your Headscale address if you run one
zh_hant: 預設為 Tailscale 官方；自架 Headscale 填它的位址

source: 默认模型
en: Default model
zh_hant: 預設模型

source: 默认（%@）
en: Default (%@)
zh_hant: 預設（%@）

source: （%@ 到期）
en: (due %@)

source: （%@ 是空目录）
en: (%@ is empty)
zh_hant: （%@ 是空目錄）

source: （OpenCode Go，自动附带会话标识）。
en: (OpenCode Go; a session ID is added automatically).
zh_hant: （OpenCode Go，自動附帶會話標識）。

source: （低数据模式）
en: (Low Data Mode)
zh_hant: （低資料模式）

# （共 %lld 行，这里是 %lld–%lld 行；继续读传 offset=%lld）
source: （共 %1$lld 行，这里是 %2$lld–%3$lld 行；继续读传 offset=%4$lld）
en: (%1$lld lines in total; these are lines %2$lld–%3$lld. Pass offset=%4$lld to read on)
zh_hant: （共 %lld 行，這裡是 %lld–%lld 行；繼續讀傳 offset=%lld）

source: （密钥 %@）
en: (key %@)
zh_hant: （金鑰 %@）

source: （已保存密码）
en: (password saved)
zh_hant: （已保存密碼）

source: （按流量计费）
en: (metered)
zh_hant: （按流量計費）

source: （文档里没有文字）
en: (The document has no text)
zh_hant: （文檔裡沒有文字）

source: （无标题）
en: (untitled)
zh_hant: （無標題）

source: （未保存密码）
en: (no saved password)
zh_hant: （未保存密碼）

source: （没有可提取的文字，可能是扫描件）
en: (no extractable text; possibly a scan)
zh_hant: （沒有可擷取的文字，可能是掃描檔）

source: （没有输出）
en: (no output)
zh_hant: （沒有輸出）

source: （没有）
en: (none)
zh_hant: （沒有）

source: （目录太大，只找了前 %lld 项）
en: (The folder is too big; only the first %lld items were searched)
zh_hant: （目錄太大，只找了前 %lld 項）

source: （空文件）
en: (empty file)
zh_hant: （空檔案）

source: （还没有服务器）
en: (no servers yet)
zh_hant: （還沒有伺服器）

source: （还没有输出）
en: (no output yet)
zh_hant: （還沒有輸出）

source: （这一页没有可提取的文字，可能是图片或扫描件）
en: (No text to extract on this page; it may be an image or a scan)
zh_hant: （這一頁沒有可提取的文字，可能是圖片或掃描件）

source: （页面上没有可读的内容）
en: (nothing readable on the page)
zh_hant: （頁面上沒有可讀的內容）

source: （页面仍在载入）
en: (the page is still loading)
zh_hant: （頁面仍在載入）

source: ，在共享文件夹里：%@
en: , in the shared folder: %@
zh_hant: ，在共享資料夾裡：%@

source: ，编号 %@
en: , ID %@
zh_hant: ，編號 %@

source: ：可以用 manage_files 的 unzip 解压
en: : unzip it with manage_files
zh_hant: ：可以用 manage_files 的 unzip 解壓

source: ［图片］
en: [image]
zh_hant: ［圖片］

source: ［当前焦点］
en: [focused]
zh_hant: ［當前焦點］

source: ［当前］
en: [current]
zh_hant: ［目前］
